import { FILMS_ADD_COMMENT } from './types.js';

const initState =
[
  {
    id : 0,
    path : 'Legenda',
    src : 'https://www.youtube.com/embed/k7izcLjrArc',
    slider : {
      currentSlide : 1,
      slides :
      [
        {
          src : '',
          id : 0,
        },
        {
          src : `https://disgustingmen.com/wp-content/uploads/2015/10/HardyKrayLegend.jpg`,
          id : 1,
        },
        {
          src : `https://i.pinimg.com/736x/6f/79/0c/6f790cd388e5c717d08060e568f45930--legend-krays-tom-hardy-legend.jpg`,
          id : 2,
        },
        {
          src : `https://www.film.ru/sites/default/files/movies/frames/015_31.jpg`,
          id : 3,
        },
        {
          src : `https://fs.kinomania.ru/file/film_frame/e/06/e06849f6166745b43eaa81a256d3c4bc.jpeg`,
          id : 4,
        },
      ],
    },
    country : 'Великобритания, Франция, США',
    genre : 'криминал, триллер, драма',
    compositor : 'Картер Бёруэлл',
    director : 'Брайан Хелгеленд',
    scenario : 'Брайан Хелгеленд, Джон Пирсон',
    producer : 'Тим Беван, Крис Кларк, Квентин Кертис',
    operator : 'Дик Поуп',
    budjet : '$25 000 000',
    comments :
    [
      {
        author :
        {
          id : '11111111',
          firstName : 'Евгения',
          lastName: 'Петрова',
          mainPhoto : 'https://ulibky.ru/wp-content/uploads/2019/10/avatarki_dlya_vatsap_dlya_devushek_42_28061027.jpg',
        },
        data : '02 мая 2022',
        text : `Вдохновившись успехами 'Козырьков', британские продюсеры судорожно перелопатили
        криминальную историю Королевства и вспомнили о братьях Крэй. Вот только повторять хорошо
        получается далеко не у всех и не всегда. Вместо вкусной динамичной драмы о мафии Туманного
        получилась какая-то бесчувственная документальная экранизация событий. Если резюмировать сюжет,
        получается история о том, как же 'плохо, когда у тебя брат чокнутый', рассказанная девочкой из
        рабочего квартала. Сидишь весь фильм и ждешь, когда же начнется история. До самых титров ждешь.`,
        rating : 0,
      },
      {
        author :
        {
          id : '44444444',
          firstName : 'Константин',
          lastName: 'Минин',
          mainPhoto : 'https://avatarko.ru/img/kartinka/1/Jack_Vorobei.jpg',
        },
        data : '03 июн 2022',
        text : `По большому счету, фильм действительно можно описать в этих двух словах. Главный
        герой постоянно пытается уладить отношения со своей возлюбленной и братом-шизофреником,
        который всячески рушит бизнес главного героя. Девушке не нравится брат главного героя - из-за
        него он постоянно попадает в передряги. Начиная с того, что ведет себя странно на публике и
        отпугивает гостей тем, что открыто заявляет, что он гомосексуалист и кидает неуместные шутки
        в силу того, что у него психическое расстройство, заканчивая тем, что он открыто в баре заявляет
        что он и его брат бандиты, они занимаются рекетом, отмыванием денег и бизнес брата нелегален`,
        rating : 4,
      },
    ],
    title : 'Легенда',
    poster : 'https://i.ebayimg.com/images/g/p78AAOSwvRdhu8ys/s-l500.jpg',
    genre :
    [
      'преступление', 'триллер',
    ],
    duration : 131,
    rating : 7.2,
    description : `Фильм расскажет историю близнецов Реджи и Ронни Крэй,
     культовых фигур преступного мира Великобритании 1960-х. Братья возглавляли
     самую влиятельную бандитскую группировку Ист-Энда. В их послужном списке:
     вооруженные грабежи, рэкет, поджоги, покушения, убийства и собственный
     ночной клуб, куда доезжали даже голливудские знаменитости. Среди их жертв —
     криминальные авторитеты Джек МакВитти и Джордж Корнелл.`,
    date : 2015,
  },
  {
    id : 1,
    path : 'KINGSMAN',
    src : 'https://www.youtube.com/embed/kTqOMbkto0A',
    slider : {
      currentSlide : 1,
      slides :
      [
        {
          src : '',
          id : 0,
        },
        {
          src : 'https://i.artfile.ru/2000x1124_1496432_[www.ArtFile.ru].jpg',
          id : 1,
        },
        {
          src : 'https://mtv.mtvnimages.com/uri/mgid:ao:image:mtv.com:678181?quality=0.8&format=jpg&width=1440&height=810&.jpg',
          id : 2,
        },
        {
          src : 'https://i.rutab.net/upload/2019/userfiles/__5d423b543602e.jpg',
          id : 3,
        },
        {
          src : 'https://avatars.mds.yandex.net/get-kinopoisk-post-thumb/1540726/b9eed9263ea727c7602336fd588deea0/orig',
          id : 4,
        },
        {
          src : 'https://hr-tv.ru/local/images/hrtv/kgc-011_jpg_1506246487_36054_jpg_1506247207.jpg',
          id : 5,
        },
      ],
    },
    country : 'Великобритания, США',
    genre : 'боевик, комедия, криминал',
    compositor : 'Генри Джекман, Мэттью Марджесон',
    director : 'Мэттью Вон',
    scenario : 'Джейн Голдман, Мэттью Вон, Марк Миллар',
    producer : 'Адам Болинг, Дэвид Рейд, Мэттью Вон',
    operator : 'Джордж Ричмонд',
    budjet : '$81 000 000',
    comments :
    [
      {
        text : `Итак, ввиду непредвиденных потерь шпионскому агентству срочно требуется новый член команды.
        Как обычно это бывает выбор падает на самые неочевидные варианты и вот, прожигающий свою жизнь Гэри,
        отец которого некогда был в команде, но героически погиб, уже в числе кандидатов. И, хотя добрую часть
        подготовки они проходят весьма сомнительные тесты на пригодность, при этом никаких физических подготовок
        не наблюдается, к концу фильма наш герой уже просто виртуоз, наверное, тут зритель должен понять, что
        он же бывший морпех недоучка, его уже научили там, зачем стараться тут. ОК. Костюм одели, игрушки
        показали, боец готов, давайте злодея.`,
        author :
        {
          id : '44444444',
          firstName : 'Константин',
          lastName : 'Минин',
          mainPhoto : 'https://avatarko.ru/img/kartinka/1/Jack_Vorobei.jpg',
        },
        data : '23 июн 2022',
        rating : -10,
      },
      {
        text : `Мне очень лень писать длинную рецензию насчет этого фильма, тем более, что она будет отрицательной и многим не понравится.
        Я искренне верила в то, что это будет комедийное переосмысление фильмов про шпионов, но этого не случилось. 1. Комедии как таковой
        не получилось. В большинстве случаев не смешно, а когда смешно, то кажется что это получилось случайно.2. Повторение сцены в начале и
        в конце сыграло для меня скорее отрицательную роль, нежели положительную, потому что это было абсолютно бессмысленно. 3. Слишком явно видно
        чудовищное количество заимствований клише из других фильмов. И сделано это очень плохо. Прекрасно понимаю, насколько сейчас сложно придумать
        что-то новое и все, в конце-концов, уже было, но есть фильмы`,
        author :
        {
          id : '172787588',
          firstName : 'Кирилл',
          lastName : 'Рогов',
          mainPhoto : 'https://sun9-10.userapi.com/impg/R-MkoRP-pOt_BNNPLn5wMSnzCyrB0oWHo3f4OQ/GJM9Ar0lDMA.jpg?size=864x1080&quality=96&sign=141a66ac561501b6a62cebca86037ecc&type=album',
        },
        data : '20 июн 2022',
        rating : -1,
      },
    ],
    title : `King's man`,
    poster : 'https://a.allegroimg.com/original/119ed4/217e2fdb4005a1c03ef8e74f71fc/KINGSMAN-TAJNE-SLUZBY-DVD',
    genre :
    [
      'боевик', 'комедия', 'преступление'
    ],
    duration : 130,
    rating : 7.7,
    description : `Парень Эггси прошел службу в морской пехоте и имеет очень высокий уровень интеллекта.
    Он мог бы добиться многого, но выбрал другой путь и стал мелким преступником. Однажды он знакомится с
    Гарри Хартом, которому его отец когда-то спас жизнь. Этот человек решил сделать все возможное,
    чтобы сделать жизнь Эггси лучше и открыть для него новые возможности. Гарри рассказал ему,
    что является агентом секретной независимой организации, которая стоит на защите всего мира,
    и теперь он предлагает парню пройти обучение и стать новым членом их команды.`,
    date : 2015,
  },
  {
    id : 2,
    path : 'NewDeaf',
    src : 'https://www.youtube.com/embed/BBcdGAWfumc',
    slider : {
      currentSlide : 1,
      slides :
      [
        { src : '',
          id : 0,
        },
        { src : 'https://images.kinorium.com/movie/shot/1527706/w1500_937171.jpg',
          id : 1,
        },
        { src : 'https://culturess.com/files/image-exchange/2020/11/ie_60051.jpeg',
          id : 2,
        },
        { src : 'https://newslab.ru/Static/afisha/2020-11-0/Vzaperti-250506.jpg',
          id : 3,
        },
        { src : 'http://hds6.tasx.uz/images/2021-01-07/1610017711_hmlml7tlxypmyb3owp52sa4rf.jpg',
          id : 4,
        },
        { src : 'https://media.kg-portal.ru/images/run2020/run2020_11.jpg',
          id : 5,
        },
      ],
    },
    country : 'США, Канада',
    genre : 'триллер, драма, детектив',
    compositor : 'Торин Борроудэйл',
    director : 'Аниш Чаганти',
    scenario : 'Аниш Чаганти, Севак Оганян',
    producer : 'Натали Касабян, Севак Оганян, Ронда Бэйкер',
    operator : 'Хиллари Спера',
    budjet : '$1 000 000',
    comments :
    [
      {
        text : `Итак, ввиду непредвиденных потерь шпионскому агентству срочно требуется новый член команды.
        Как обычно это бывает выбор падает на самые неочевидные варианты и вот, прожигающий свою жизнь Гэри,
        отец которого некогда был в команде, но героически погиб, уже в числе кандидатов. И, хотя добрую часть
        подготовки они проходят весьма сомнительные тесты на пригодность, при этом никаких физических подготовок
        не наблюдается, к концу фильма наш герой уже просто виртуоз, наверное, тут зритель должен понять, что
        он же бывший морпех недоучка, его уже научили там, зачем стараться тут. ОК. Костюм одели, игрушки
        показали, боец готов, давайте злодея.`,
        author :
        {
          id: '11111111',
          firstName : 'Евгения',
          lastName : 'Петрова',
          mainPhoto : 'https://ulibky.ru/wp-content/uploads/2019/10/avatarki_dlya_vatsap_dlya_devushek_42_28061027.jpg',
        },
        data : '03 июл 2022',
        rating : 16,
      },
      {
        text : `Сразу подмечу, что 'Взаперти' - это не особо страшный фильм. В нём есть некая напряженная атмосфера,
        но она не заставила меня бояться происходящего на экране. Да я и не за порцией испугов пошёл на этот фильм.
        По трейлеру мне в первую очередь показалось, что это будет качественный детектив с очень запутанным сюжетом,
        который притянет меня из-за хорошо проработанного сценария. Но на деле получилось совершенно другое кино,
        полностью противоположное моим ожиданиям. Здесь, конечно, есть некоторые сюжетные повороты, но дело в том,
        что всё сразу становится понятно: здесь нет никакой путаницы в сюжете, нам прямо намекают, что и как должно
        происходить.`,
        author :
        {
          id: '172787588',
          firstName : 'Кирилл',
          lastName : 'Рогов',
          mainPhoto : 'https://sun9-10.userapi.com/impg/R-MkoRP-pOt_BNNPLn5wMSnzCyrB0oWHo3f4OQ/GJM9Ar0lDMA.jpg?size=864x1080&quality=96&sign=141a66ac561501b6a62cebca86037ecc&type=album',
        },
        data : '07 апр 2022',
        rating : 6,
      },
    ],
    title : 'Взаперти',
    poster : 'https://a.allegroimg.com/original/11081b/ae72051c4a409ec9a4f6d1cafd97/BIEGNIJ-DVD',
    genre :
    [
      'триллер', 'драма', 'детектив'
    ],
    duration : 90,
    rating : 6.8,
    description : `Гиперзаботливая мать-одиночка Диана Шерман воспитывает дочь Хлою в полной изоляции,
    контролируя каждый её шаг. Та прикована к инвалидному креслу, принимает множество таблеток, обучается дома
    и не общается со сверстниками. Разумеется, Хлоя растет наивной девушкой, но однажды она начинает
    подозревать что-то неладное.`,
    date : 2020,
  },
  {
    id : 3,
    path : '1408',
    src : 'https://www.youtube.com/embed/1xWDRFFWTYU',
    slider : {
      currentSlide : 1,
      slides :
      [
        {
          src : '',
          id : 0,
        },
        {
          src : 'https://www.film.ru/sites/default/files/images/5555-27(2).jpg',
          id : 1,
        },
        {
          src : 'https://www.film.ru/sites/default/files/images/1408-%D1%84%D0%B8%D0%BB%D1%8C%D0%BC.jpg',
          id : 2,
        },
        {
          src : 'https://media.kg-portal.ru/images/1408/1408_27.jpg',
          id : 3,
        },
        {
          src : 'https://media.kg-portal.ru/images/1408/1408_14.jpg',
          id : 4,
        },
        {
          src : 'https://media.kg-portal.ru/images/1408/1408_29.jpg',
          id : 5,
        },
        {
          src : 'https://media.kg-portal.ru/images/1408/1408_28.jpg',
          id : 6,
        },
      ],
    },
    country : 'США',
    genre : 'ужасы, триллер',
    compositor : 'Габриэль Яред',
    director : 'Лоренцо Ди Бонавентура',
    scenario : 'Мэтт Гринберг, Скотт Александер',
    producer : 'Лоренцо Ди Бонавентура, Келли Дэннис, Антония Калмакофф',
    operator : 'Бенуа Деломм',
    budjet : '$25 000 000',
    comments :
    [
      {
        text : `1408 - магическое завораживающее число. Несуществующий 13 этаж (14 в отелях класса 'Дельфин'),
        номер 1408 (в сумме 13)... Всё это завораживает уже изначально. Стивен Кинг - мастер ужаса психологического,
        потаенного, скрытого внутри каждого человека. При просмотре фильма каждый найдёт себе фобию по душе,
        если можно так выразиться (у меня, например, клаустрофобия, и самая страшная для меня сцена в фильме
          была в вентиляционной шахте). Самое прекрасное в этой всей истории это то, что она действительно страшная.
          Нас не пытаются запугать мерзко гримированными мутантами, отрубаниями резиновых конечностей или реками крови,
          нас пугают НАШИМИ же страхами.`,
          author :
          {
            id : '11111111',
            firstName : 'Евгения',
            lastName : 'Петрова',
            mainPhoto : 'https://ulibky.ru/wp-content/uploads/2019/10/avatarki_dlya_vatsap_dlya_devushek_42_28061027.jpg',
          },
          data : '23 мая 2022',
          rating : 4,
      },
      {
        text : `«Но номера отелей сами по себе вызывают страх, не так ли? Входя в номер, поневоле задаешься вопросом,
        сколько людей спали до тебя на этой кровати? Сколько среди них было больных? Сколько сумасшедших? Сколько думало о том,
        чтобы прочесть несколько строк из Библии, что лежит на прикроватном столике, и повеситься в стенном шкафу у телевизора?
        Бр р р. В любом случае, давайте проверим, а? Вот ваш ключ… и вы можете не торопясь, прикинуть, что дадут в сумме эти
        четыре невинные цифры». С. Кинг.`,
        author :
        {
          id : '44444444',
          firstName : 'Константин',
          lastName : 'Минин',
          mainPhoto : 'https://avatarko.ru/img/kartinka/1/Jack_Vorobei.jpg',
        },
        data : '06 июн 2022',
        rating : 1,
      },
    ],
    title : '1408',
    poster : 'https://papik.pro/uploads/posts/2021-10/1634618471_5-papik-pro-p-1408-poster-5.jpg',
    genre :
    [
      'ужасы', 'триллер'
    ],
    duration : 104,
    rating : 7.7,
    description : `Известный писатель Майк Энслин, автор хоррор-романов, пишет очередную книгу
    о необычных явлениях и полтергейсте в отелях. Не веря в существование загробной жизни,
    Энслин решает поселиться в печально известном номере 1408 отеля «Дельфин», который пустует
    многие годы - по слухам, там обитают привидения. Невзирая на предупреждение менеджера отеля,
    упрямец настаивает на своём, даже не предполагая, каким кошмаром обернется предстоящая ночь.`,
    date : 2008,
  },
  {
    id : 4,
    path : 'Happines',
    src : 'https://www.youtube.com/embed/Q-W2L9nyJTY',
    slider : {
      currentSlide : 1,
      slides :
      [
       {
         src : '',
         id : 0,
       },
       {
         src : 'https://m.media-amazon.com/images/M/MV5BMTg5NTA2ODM5OF5BMl5BanBnXkFtZTcwOTc0NjYyMw@@._V1_.jpg',
         id : 1,
       },
       {
         src : 'https://m.media-amazon.com/images/M/MV5BMTUzNTI2MTU3N15BMl5BanBnXkFtZTcwMzg0NjYyMw@@._V1_.jpg',
         id : 2,
       },
       {
         src : 'https://igma.am/uploads/images/img_1920x_60885e743e99e.jpg',
         id : 3,
       },
       {
         src : 'https://m.media-amazon.com/images/M/MV5BMTk0ODI5NjA5N15BMl5BanBnXkFtZTcwMDc0NjYyMw@@._V1_.jpg',
         id : 4,
       },
       {
         src : 'https://m.media-amazon.com/images/M/MV5BNjNiNzUzNGEtYjg3My00OTczLWE0ZDktZmQ2ODNmMTM5ZDczL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyNTc3MjUzNTI@._V1_.jpg',
         id : 5,
       },
       {
         src : 'https://m.media-amazon.com/images/M/MV5BMjIyNjU3MTU1OF5BMl5BanBnXkFtZTcwNDc0NjYyMw@@._V1_.jpg',
         id : 6,
       },
       {
         src : 'https://productplacementblog.com/wp-content/uploads/2020/07/Rubiks-Cube-Held-by-Brian-Howe-as-Jay-Twistle-in-The-Pursuit-of-Happyness.jpg',
         id : 7,
       },
     ],
    },
    country : 'США',
    genre : 'драма, биография',
    compositor : 'Картер Бёруэлл',
    director : 'Габриэле Муччино',
    scenario : 'Стивен Конрад',
    producer : 'Тодд Блэк, Джейсон Блюменталь, Джеймс Ласситер',
    operator : 'Фидон Папамайкл',
    budjet : '$55 000 000',
    comments :
    [
      {
        text : `
        Забавно но все дело в том, что нам показывают весь фильм беды главного героя, который
        страдает от ущербной денежной системы и в то же время желающий в нее непременно вжиться.

        И он своего черт возьми добивается. Он становится брокером - человеком по сути своей бесполезным.
        Реально, что брокеры производят толкового? Это лишь винтики которые эксплуатируют и поддерживают эту
        гнилую мировую финансовую систему, последствия которой нам показывают большую часть фильма - бедность,
        преступность и коррупция. Один человек выбрался из этого дерьма (выбрался ли?), стал холопом у системы.
        Теперь он с ребенком может спокойно пройтись. Пройтись сквозь никуда не исчезнувшую бедность вокруг.
        Теперь он и сам причина такого положения вещей.`,
        author :
        {
          id : '172787588',
          firstName : 'Кирилл',
          lastName : 'Рогов',
          mainPhoto : 'https://sun9-10.userapi.com/impg/R-MkoRP-pOt_BNNPLn5wMSnzCyrB0oWHo3f4OQ/GJM9Ar0lDMA.jpg?size=864x1080&quality=96&sign=141a66ac561501b6a62cebca86037ecc&type=album',
        },
        data: '04 мая 2022',
        rating : 10,
      },
      {
        text : `Это довольно хорошо поставленная, с неочевидным навязыванием мнения кинопропаганда. Что пропагандирует этот фильм?
        И против чего он пропогандирует? Вопрос этот не очевиден, и на этот счёт могут существовать различные мнения. Расскажу своё:

        Пропагандируется то, что я понимаю как некоторый 'стандартный набор ценностей стандартного американского гражданина',
        пропагандируется стремление стать богатым, то есть эквивалентность счастья и богатства. Что подчёркивается в названии.
        Причём достичь богатства и превосходства над другими. И придти к этому своими собственными силами, видя в окружающих
        тебя людях лишь соперников в преследовании 'счастья'. И это показывается таким образом, что кажется - это единственно верный
        путь развития. Всё зависит от того как ты напрягаешься в жизни. `,
        author :
        {
          id : '33333333',
          firstName : 'Анастасия',
          lastName : 'Сидорова',
          mainPhoto : 'https://ulibky.ru/wp-content/uploads/2019/10/avatarki_dlya_vatsap_dlya_devushek_22_28060952.jpg',
        },
        data: '01 июн 2022',
        rating : -3,
      },
    ],
    title : 'В погоне за счастьем',
    poster : 'https://img.csfd.cz/files/images/film/posters/162/376/162376215_5f77f1.jpg',
    genre :
    [
      'драма', 'биография'
    ],
    duration : 117,
    path : 'Happines',
    rating : 8.3,
    description : `Крис Гарднер – отец-одиночка. Воспитывая пятилетнего сына, Крис изо всех сил старается сделать так, чтобы ребенок рос счастливым.
    Работая продавцом, он не может оплатить квартиру, и их выселяют.
    Оказавшись на улице, но не желая сдаваться, отец устраивается стажером в брокерскую компанию,
    рассчитывая получить должность специалиста. Только на протяжении стажировки он не будет получать
    никаких денег, а стажировка длится 6 месяцев...`,
    date : 2006,
  },
  {
    path : 'SocialNetwork',
    src : 'https://www.youtube.com/embed/54izAMhnj0c',
    slider : {
      currentSlide : 1,
      slides :
      [
        {
          src : '',
          id : 0,
        },
        {
          src : 'https://filmthreat.com/wp-content/uploads/2019/07/FEATURE-the-social-network-00A.jpg',
          id : 1,
        },
        {
          src : 'http://litcult.ru/u/dd/news/11923/image.jpg',
          id : 2,
        },
        {
          src : 'https://www.noonpost.com/sites/default/files/styles/article_image_1226_x_840/public/field/image/mtqdt.jpg?itok=bByCfvM3',
          id : 3,
        },
        {
          src : 'https://a.d-cd.net/df2223u-960.jpg',
          id : 4,
        },
        {
          src : 'https://m.media-amazon.com/images/M/MV5BOTY2NTg3NjM3M15BMl5BanBnXkFtZTcwODY0NTE5Mw@@._V1_.jpg',
          id : 5,
        },
        {
          src : 'https://www.kinonews.ru/insimgs/shotimg/shotimg10103_3.jpg',
          id : 6,
        },
        {
          src : 'https://ic.pics.livejournal.com/dm_bondarenko/23992180/64252/64252_original.jpg',
          id : 7,
        },
      ],
    },
    country : 'США',
    genre : 'драма, биография',
    compositor : 'Трент Резнор, Аттикус Росс',
    director : 'Дэвид Финчер',
    scenario : 'Аарон Соркин, Бен Мезрич',
    producer : 'Дэна Брунетти, Сиан Чаффин, Майкл Де Лука',
    operator : 'Джефф Кроненвет',
    budjet : '$50 000 000',
    comments :
    [
      {
        text : `Нет будущего другого, кроме того, что мы творим сами.
        Раз в столетие в мире появляется гений с невероятной идеей, меняющей все вокруг.
        Марк Цукерберг – создатель социальной сети Facebook, стал самым молодым в истории миллиардером.
        Основным отличием Facebook от существовавших тогда социальных сетей стала именно возможность контакта.
        Цукерберг предложил людям простой и удобный способ обмениваться информацией друг о друге. Целью сайта
        было не нахождение новых друзей, а удобное поддержание связей со старыми. Понятно, что в первую очередь в
        таком сервисе нуждаются реальные сообщества — школы и университеты. Но чтобы преуспеть, Facebook должен был
        заинтересовать и всех остальных. Марк Цукерберг запустил свой сайт на следующий год после старта MySpace,
        но обошел всех конкурентов в главном. Он сумел привлечь в сеть не только ботаников и интернет-маньяков,
        но и всю остальную веб-аудиторию. Цукерберг сделал свои миллиарды, казалось бы, на очень простых вещах -
        естественной потребности людей к общению и на их стремлении к славе, благодаря наличию определенных услуг
        и многофункциональности данного интернет ресурса.`,
        author :
        {
          id : '55555555',
          firstName : 'Пётр',
          lastName : 'Романов',
          mainPhoto : 'https://avatarko.ru/img/kartinka/29/muzhchina_soldat_28583.jpg',
        },
        data : '06 март 2022',
        rating : 3,
      },
      {
        text : `Главное послание, заключенное в фильме 'Социальная сеть', какое-то сомнительное: если пипл хавает то,
        что ты придумал, то ты крутой! Даже если этот пипл - это стадо баранов. Но ведь никто не считает крутыми
        изобретателей наркотиков? Или лапши доширак, которую все едят. А ведь социальные сети ничем не круче, и не
        полезней, и не содержательней…

        История подается как очень выдающаяся. Это из-за масштаба состояния, которое сколотил еврейский парень?
        На мой взгляд, это единственный факт который - даже в массовом сознании - заинтриговывает в этой истории.
        Единственное достоинство сюжета и фильма - так и не сбывшаяся американская мечта: на вот тебе и кучу бабла,
        и обожание масс, а все равно, если ты спесивый говнюк - то и жизнь ты проживешь, как спесивый говнюк.`,
        author :
        {
          id : '22222222',
          firstName : 'София',
          lastName : 'Сидорова',
          mainPhoto : 'https://coolsen.ru/wp-content/uploads/2021/06/48_2.jpg',
        },
        data : '01 янв 2022',
        rating : 23,
      },
    ],
    id : 5,
    title : 'Социальная сеть',
    poster : 'https://i.pinimg.com/originals/e4/d8/12/e4d8121bec930e6aca078e237a54b4c0.jpg',
    genre :
    [
      'драма', 'биография',
    ],
    duration : 120,
    path : 'SocialNetwork',
    rating : 7.7,
    description : `В фильме рассказывается история создания одной из самых популярных в Интернете
    социальных сетей - Facebook. Оглушительный успех этой сети среди пользователей по всему миру
    навсегда изменил жизнь студентов-однокурсников гарвардского университета, которые основали ее в
    2004 году и за несколько лет стали самыми молодыми мультимиллионерами в США.`,
    date : 2010,
  },
]

export const filmsReducer = (state = initState, action) => {
  switch (action.type) {
    case FILMS_ADD_COMMENT: {
      if (action.payload.text.trim().length) {
        const { payload } = action
        const { user } = payload

        const newComment = {
          text : payload.text,
          author :
          {
            id : user.id,
            mainPhoto : user.mainPhoto,
            firstName : user.firstName,
            lastName : user.lastName,
          },
          date : action.payload.date,
          likes : 0,
          dislikes : 0,
        }

        return state.map(film => {
          if (film.id !== payload.film) {
            return film
          } else {
            return {
              ...film,
              comments : [...film.comments, newComment]
            }
          }
        })
       }
      }
    default:
    return state
  }
}
